app/Http/Controllers/PostController.php

SELECT * FROM `categories`
SELECT * FROM `posts` ORDER BY `created_at` DESC
---
    public function index (){
        return view('index', [
            "posts" => Post::latest()->filter(request(["search", "category"]))->get(),
            "categories" => Category::all(),
        ]);

SELECT * FROM `categories`
---
    public function create()
    {
        return view('posts.create', [
            "categories" => Category::all()
        ]);